#!/usr/bin/env python
# coding: utf-8

# 1. Дано натуральне число n. Визначте у ньому кількість та суму цифр.
# Число n ввести за допомогою функції input( ), n - п’ятизначне і більше число.
# Результат вивести.

# In[1]:


n = int(input())
print('n: {}'.format(n))
print('кількість цифр: {}'.format(len(str(n))))
print('сума цифр: {}'.format(sum([int(i) for i in str(n)])))


# 2. Користувач вводить два числа. Одне присвоюється одній змінній, а друге - іншій. Необхідно змінити значення змінних так, щоб значення першої виявилося в другій, а другої - в першій.

# In[2]:


a = float(input('Enter a: '))
b = float(input('Enter b: '))
print('a: {}, b: {}'.format(a, b))
a, b = b, a
print('a: {}, b: {}'.format(a, b))


# 3. Ввести за допомогою функції input( ) стрічку. Визначити перший середній і останній елемент у введеній стрічці
# Результат вивести.

# In[3]:


string = input('Input string: ')
print('First element: {}\nMiddle element: {}\nLast element: {}'      .format(string[0], string[int(len(string)/2)], string[-1]))


# 4. Ввести за допомогою функції input( ) п’ятизначне парне число. Визначити першу і останню цифру числа у введеній стрічці
# Результат вивести.

# In[4]:


n = int(input('Enter n (n>=10000 and n//2 == 0): '))
if n >= 10000 and n % 2 == 0:
    print('First number: {}\nLast number: {}'.format(str(n)[0], str(n)[-1]))


# 5. Вивести на екран чотири рядки що складаються з нулів, причому кількість нулів у кожному рядку дорівнює номеру рядка. Функцію print( ) використати один раз.

# In[5]:


for i in range(1,5):
    print('0' * i)


# 6. Дано два тризначних числа. Знайдіть шестизначне число, утворене з двох даних чисел шляхом дописування другого числа до першого справа.
#

# In[6]:


a = input('Enter a: ')
b = input('Enter b: ')
print('a + b = {}'.format(str(a + b)))


# 7 .Напишіть код, який переводить ціле число в рядок, при тому що його можна застосувати в будь-якій системі числення.
#
# При заданому цілому числі n, виведіть результат: n + nn + nnn.
# n – трьох значне число.

# In[7]:


n = 123
n_str = str(n)
print('n = {}\nnn = {}\nnnn = {}'.format(int(n_str), int(n_str + n_str), int(n_str + n_str + n_str)))
print('n + nn + nnn = {}'.format(int(n_str) + int(n_str + n_str) + int(n_str + n_str + n_str)))

